Autodesk.Revit.DB.Level.PlaneReference
Returns a reference to this element as a plane.
Remarks: The object returned here can be used with the
Autodesk.Revit.DB.PointOnPlane class.

Autodesk.Revit.DB.Level.LevelType
The level style of this level.

Autodesk.Revit.DB.Level.ProjectElevation
Retrieve the elevation relative to project origin, no matter
what values of the Elevation Base parameter is set.
Remarks: This read only property returns the elevation relative to
project origin.

Autodesk.Revit.DB.Level.Elevation
Retrieves or changes the elevation above or below the ground level.
Remarks: This property retrieves or changes the elevation above or below the ground level of the
project. If the Elevation Base parameter is set to Project, the elevation is relative to project origin.
If the Elevation Base parameter is set to Shared, the elevation is relative to shared origin which can
be changed by relocate operation. The value is given in decimal feet.

Autodesk.Revit.DB.Level
Represents a Level line within Autodesk Revit.
Remarks: The Name property can be used to retrieve
the user visible name of the level that appears in the level bubble.